/*
      ┏┓┏━┳┏━┏┓┏┳┓┃┏┓┏┓┳┃┏┓┏┓
      ┃┃┣━┃┣━┣┫┃┃┃┃┃┃┣┫┃┃┗┛┃┃
      ┣┛┗━┃┗━┃┗┃┃┃┃┃┃┃┃┃┃  ┃┃
 
             ⠤⠶⠶⠶⠶⠶⠶⠤⠄
 ⠀⠀⠀⠀⠀⠀⠀⠠⠾⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠷⠄
 ⠀⠀⠀⠀⠀⠀⠠⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠄
 ⠀⠀⠀⠀⠀⠀⠸⠿⠛⠉⠉⠉⠻⠿⠿⠟⠉⠉⠉⠛⠿⠇
 ⠀⠀⠀⠀⠀⠀⠸⠇⠀⠀⠶⠀⠸⠿⠿⠇ 🔵 ⠸⠇
 ⠀⠀⠀⠀⠀⠀⠀⠻⠶⠤⠤⠠⠿⠃⠘⠿⠄⠤⠤⠶⠟
 ⠀⠀⠀⠀⠀⠀⠀⠾⠿⠙⠶⠿⠿⠤⠤⠿⠿⠶⠏⠻⠷
 ⠀⠀⠀⠀⠀⠀⠀⠻⠶⠜⠰⠭⠩⠍⠭⠍⠭⠱⠠⠶⠟
 ⠀⠀⠀⠀⠠⠶⠦⠈⠻⠿⠶⠭⠘⠃⠛⠃⠫⠴⠿⠟⠡⠾⠟⠂
 ⠀⠀⠀⠀⠊⠉⠛⠳⠦⠈⠉⠛⠛⠛⠛⠛⠛⠉⠁⠠⠿⠋⠀⠱⠄
 ⠀⠀⠀⠔⠀⠀⠄⠀⠉⠳⠦⠄⠳⠶⠶⠃⠠⠤⠞⠛⠁⠠⠂⠀⠙⠄
 ⠀⠀⠎⠀⠀⠀⠇⠀⠀⠸⠀⠏⠠⠭⠍⠈⠏⠇⠀⠀⠀⠼⠀⠀⠀⠙⠆
 ⠀⠼⠀⠀⠀⠀⠷⠔⠒⠚⠍⠣⠸⠿⠿⠸⠋⠇⠠⠴⠚⠹⠀⠀⠀⠀⠻
 ⠀⠻⠄⠀⠀⠰⠁⠀⠀⠀⠗⠹⠸⠿⠿⠸⠉⠇⠇⠀⠀⠈⠇⠀⠀⠀⠸
 ⠀⠀⠙⠦⠄⠸⠀⠀⠀⠀⠱⠹⠸⠿⠿⠸⠹⠜⠀⠀⠀⠀⠇⠀⠀⠴⠋
 ⠀⠀⠀⠈⠃⠼⠶⠄⠀⠀⠸⠾⠶⠒⠒⠚⠾⠤⠤⠤⠤⠾⠃⠶⠊⠁
 ⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉
 ⠀⠀⠀⠀⠀⠀⠔⠀⠶⠀⠀⠀⠀⠀⠀⠀⠀⠸⠇⠀⠀⠣
 ⠀⠀⠀⠀⠀⠀⠇⠸⠇⠀⠀⠀⠀⠎⠆⠀⠀⠸⠧⠀⠀⠸
 ⠀⠀⠀⠀⠀⠰⠁⠾⠁⠀⠀⠀⠠⠇⠱⠀⠀⠸⠿⠀⠀⠀⠇
 ⠀⠀⠀⠀⠀⠸⠀⠿⠀⠀⠀⠀⠸⠀⠸⠀⠀⠀⠿⠀⠀⠀⠇
 ⠀⠀⠀⠀⠀⠈⠉⠉⠒⠒⠒⠒⠊⠀⠈⠒⠒⠒⠛⠓⠊⠉⠁
 ⠀⠀⠀⠀⠠⠶⠶⠤⠲⠶⠀⠀⠀⠀⠀⠀⠠⠷⠶⠶⠂⠤⠶⠦⠄
 ⠀⠀⠀⠀⠿⠿⠿⠿⠧⠩⠄⠀⠀⠀⠀⠀⠬⠭⠭⠱⠿⠿⠿⠿⠟
 
 
       ░░░░█░░░░░░░░░░░░░█░░░░
       ░░░█░░░░░░░░░░▄▄▄░░█░░░
       ░░░█░░▄▄▄░░▄░░███░░█░░░
       ░░░▄█░▄░░░▀▀▀░░░▄░█▄░░░
       ░░░█░░▀█▀█▀█▀█▀█▀░░█░░░
       ░░░▄██▄▄▀▀▀▀▀▀▀▄▄██▄░░░
       ░▄█░█▀▀█▀▀▀█▀▀▀█▀▀█░█▄░
       ▄▀░▄▄▀▄▄▀▀▀▄▀▀▀▄▄▀▄▄░▀▄
       █░░░░▀▄░█▄░░░▄█░▄▀░░░░█
       ░▀▄▄░█░░█▄▄▄▄▄█░░█░▄▄▀░
       ░░░▀██▄▄███████▄▄██▀░░░
       ░░░████████▀████████░░░
       ░░▄▄█▀▀▀▀█░░░█▀▀▀▀█▄▄░░
       ░░▀▄▄▄▄▄▀▀░░░▀▀▄▄▄▄▄▀░░
*/
 
#include <iostream>
#include <string>
#include <vector>
#include <map>
#include <set>
 
using namespace std;
 
bool readString(string &s) {
    char c;
    while (scanf("%c", &c) == 1) {
        if (c == '\n')
            break;
        s += c;
    }
 
    return !s.empty();
}
 
void deleteUseless(vector<pair<char, string>> &rules, set<char> &nonterminals) {
    vector<pair<char, string>> tmp;
    for (auto &r : rules) {
        bool usefulRule = nonterminals.count(r.first);
        for (char c : r.second)
            usefulRule = usefulRule && nonterminals.count(c);
         
        if (usefulRule)
            tmp.push_back(r);
    }
 
    swap(rules, tmp);
}
 
int main() {
    freopen("useless.in", "r", stdin);
    freopen("useless.out", "w", stdout);
 
    int n;
    char start;
    cin >> n >> start;
 
    vector<pair<char, string>> rules;
    set<char> usedNonterminals, generating;
    usedNonterminals.insert(start);
    while (n--) {
        string from;
        string to;
        cin >> from >> to;
        getline(cin, to);
 
        string nonterminals;
        for (char c : to) {
            if ('A' <= c && c <= 'Z') {
                nonterminals += c;
                usedNonterminals.insert(c);
            }
        }
        if (nonterminals.empty())
            generating.insert(from[0]);
        rules.push_back({from[0], nonterminals});
        usedNonterminals.insert(from[0]);
    }
 
    size_t prev = -1;
    while (prev != generating.size()) {
        prev = generating.size();
        for (auto &r : rules) {
            bool satisfy = true;
            for (char c : r.second)
                satisfy = satisfy && generating.count(c);
             
            if (satisfy)
                generating.insert(r.first);
        }
    }
    deleteUseless(rules, generating);
 
    set<char> reachable;
    reachable.insert(start);
    prev = -1;
    while (prev != reachable.size()) {
        prev = reachable.size();
        for (auto &r : rules) {
            if (!reachable.count(r.first))
                continue;
             
            for (char c : r.second)
                reachable.insert(c);
        }
    }
    deleteUseless(rules, reachable);

    for (char nonterminal : usedNonterminals) {
        bool uselessNonterminal = false;
        for (auto &r : rules) {
            uselessNonterminal = uselessNonterminal || (nonterminal == r.first);
            for (char c : r.second)
                uselessNonterminal = uselessNonterminal || (nonterminal == c);
        }
 
        if (!uselessNonterminal)
            cout << nonterminal << ' ';
    }
 
    return 0;
}
